### Exercise 135: DataFrame Computations with the Student testscore Data
In this exercise, you will rename the columns of the DataFrame, and you will then select the data to display

In [3]:
import pandas as pd

In [5]:
# Create dictionary of test scores
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]}
# Create DataFrame
df = pd.DataFrame(test_dict)
df = df.T

In [7]:
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [11]:
# Rename Columns
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']

In [13]:
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [15]:
# Access first row by index number
df.iloc[0]

Quiz_1    63
Quiz_2    75
Quiz_3    88
Name: Corey, dtype: int64

In [17]:
df['Quiz_1']

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64

In [19]:
# Access first column using dot notation
df.Quiz_1

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64